# Challenge

Another approach to identifying fraudulent transactions is to look for outliers in the data. Standard deviation or quartiles are often used to detect outliers. Using this starter notebook, code two Python functions:

* One that uses standard deviation to identify anomalies for any cardholder.

* Another that uses interquartile range to identify anomalies for any cardholder.

## Identifying Outliers using Standard Deviation

In [247]:
# Initial imports
import pandas as pd
import numpy as np
import random
from sqlalchemy import create_engine

In [248]:
# Create a connection to the database
engine = create_engine("postgresql://postgres:postgres@localhost:5432/fraud_detection")

# Write a query
query = """SELECT a.transaction_id, b.cardholder_id, a.amount 
           FROM transaction a
           INNER JOIN credit_card b ON b.card_num = a.card_num
           ORDER BY b.cardholder_id ASC;"""

# Create a DataFrame from the query result.
amount_per_cardholder_df = pd.read_sql(query, engine)

# Display a DataFrame
display(amount_per_cardholder_df.head())
display(amount_per_cardholder_df.tail())

   transaction_id  cardholder_id   amount
0            2330              1   484.00
1            2067              1     1.40
2            2242              1     1.54
3            2913              1  1691.00
4             251              1     3.49

      transaction_id  cardholder_id   amount
3495            3043             25    20.03
3496             506             25     6.01
3497             301             25     7.39
3498            3342             25     2.27
3499            1863             25  1074.00

In [249]:
# Write function that locates outliers using standard deviation
# Check outliers per cardholder_id, and store only outliers in DataFrame

i = 1 # carholder_id counter
k = 0 # amount_per_cardholder_df index
amount_indivisual_cardholder_df = pd.DataFrame()

# While loop for checking each cardholder
while i < 26: 
    # Stores means and standard deviation for each cardholder
    mean = amount_per_cardholder_df['amount'].loc[amount_per_cardholder_df['cardholder_id'] == i].mean() 
    std = amount_per_cardholder_df['amount'].loc[amount_per_cardholder_df['cardholder_id'] == i].std()
    
    j = True
    l = amount_per_cardholder_df['cardholder_id'].loc[k]
    # While loop checks as long as the same cardholder
    while j == True: 

        # This checks if record is outliers
        if amount_per_cardholder_df['cardholder_id'].loc[k] == i:
            if amount_per_cardholder_df['amount'].loc[k] < (mean - 2* std): # Find lower outliers
                amount_indivisual_cardholder_df = amount_indivisual_cardholder_df.append(amount_per_cardholder_df.loc[k:k])
            elif amount_per_cardholder_df['amount'].loc[k] > (mean + 2* std): # Find higher outliers
                amount_indivisual_cardholder_df = amount_indivisual_cardholder_df.append(amount_per_cardholder_df.loc[k:k])
        
        # Checks if cardholder_id is the same as prev record
        if l != amount_per_cardholder_df['cardholder_id'].loc[k]:
            j = False
        
        # Store cardholder_id to compare to the next record
        l = amount_per_cardholder_df['cardholder_id'].loc[k]
        k += 1
        if k == 3500:
            j = False
    
    i += 1 

amount_indivisual_cardholder_df = amount_indivisual_cardholder_df.sort_values(by=['cardholder_id']).reset_index(drop=True)

In [250]:
# Show outliers
amount_indivisual_cardholder_df

    transaction_id  cardholder_id  amount
0             2913              1  1691.0
1             1536              1  1056.0
2             1368              1  1017.0
3             2497              1  1790.0
4              968              1  1060.0
..             ...            ...     ...
89             224             25   749.0
90            1877             25  1001.0
91            1377             25  1046.0
92            2582             25  1813.0
93            1863             25  1074.0

[94 rows x 3 columns]

In [251]:
# Find anomalous transactions for 3 random card holders
display(amount_indivisual_cardholder_df.loc[amount_indivisual_cardholder_df['cardholder_id'] == 1])
display(amount_indivisual_cardholder_df.loc[amount_indivisual_cardholder_df['cardholder_id'] == 4])
display(amount_indivisual_cardholder_df.loc[amount_indivisual_cardholder_df['cardholder_id'] == 24])

   transaction_id  cardholder_id  amount
0            2913              1  1691.0
1            1536              1  1056.0
2            1368              1  1017.0
3            2497              1  1790.0
4             968              1  1060.0
5            1293              1  1033.0
6            2672              1  1660.0
7            3163              1  1894.0
8            2752              1  1302.0

    transaction_id  cardholder_id  amount
14            2668              4   21.50
15            3166              4   20.88

    transaction_id  cardholder_id  amount
80            3064             24  1901.0
81            2241             24   525.0
82            1119             24  1035.0
83            2461             24  1301.0
84            1821             24  1011.0

## Identifying Outliers Using Interquartile Range

In [252]:
# Write a function that locates outliers using interquartile range
# calculate interquartile range 

# Checks outliers for cardholder_id = 1
q3_1, q1_1 = np.percentile(amount_per_cardholder_df['amount'].loc[amount_per_cardholder_df['cardholder_id'] == 1], [75 ,25])
iqr_1 = q3_1 - q1_1

# Find lower and upper bound  
lower_bound_1 = q1_1 -(1.5 * iqr_1) 
upper_bound_1 = q3_1 +(1.5 * iqr_1)

# Checks outliers for cardholder_id = 5
q3_5, q1_5 = np.percentile(amount_per_cardholder_df['amount'].loc[amount_per_cardholder_df['cardholder_id'] == 5], [75 ,25])
iqr_5 = q3_5 - q1_5

# Find lower and upper bound  
lower_bound_5 = q1_5 -(1.5 * iqr_5) 
upper_bound_5 = q3_5 +(1.5 * iqr_5)

# Checks outliers for cardholder_id = 24
q3_24, q1_24 = np.percentile(amount_per_cardholder_df['amount'].loc[amount_per_cardholder_df['cardholder_id'] == 24], [75 ,25])
iqr_24 = q3_24 - q1_24

# Find lower and upper bound  
lower_bound_24 = q1_24 -(1.5 * iqr_24) 
upper_bound_24 = q3_24 +(1.5 * iqr_24)

In [254]:
# Find anomalous transactions for 3 random card holders
# Checks outliers for cardholder_id = 1, 5, and 24
display("Anomalous transactions for Cardholder ID:1 ",amount_per_cardholder_df.loc[(amount_per_cardholder_df['cardholder_id'] == 1) & (amount_per_cardholder_df['amount'] < lower_bound_1)])
display("Anomalous transactions for Cardholder ID:1 ",amount_per_cardholder_df.loc[(amount_per_cardholder_df['cardholder_id'] == 1) & (amount_per_cardholder_df['amount'] > upper_bound_1)])

display("Anomalous transactions for Cardholder ID:5 ",amount_per_cardholder_df.loc[(amount_per_cardholder_df['cardholder_id'] == 5) & (amount_per_cardholder_df['amount'] < lower_bound_5)])
display("Anomalous transactions for Cardholder ID:5 ",amount_per_cardholder_df.loc[(amount_per_cardholder_df['cardholder_id'] == 5) & (amount_per_cardholder_df['amount'] > upper_bound_5)])

display("Anomalous transactions for Cardholder ID:24 ",amount_per_cardholder_df.loc[(amount_per_cardholder_df['cardholder_id'] == 24) & (amount_per_cardholder_df['amount'] < lower_bound_24)])
display("Anomalous transactions for Cardholder ID:24 ",amount_per_cardholder_df.loc[(amount_per_cardholder_df['cardholder_id'] == 24) & (amount_per_cardholder_df['amount'] > upper_bound_24)])

'Anomalous transactions for Cardholder ID:1 '

Empty DataFrame
Columns: [transaction_id, cardholder_id, amount]
Index: []

'Anomalous transactions for Cardholder ID:1 '

     transaction_id  cardholder_id  amount
0              2330              1   484.0
3              2913              1  1691.0
17             1536              1  1056.0
19             1368              1  1017.0
23             2497              1  1790.0
29              968              1  1060.0
73              292              1   267.0
74             3423              1   283.0
76             1293              1  1033.0
79             2672              1  1660.0
108            3163              1  1894.0
131            2752              1  1302.0

'Anomalous transactions for Cardholder ID:5 '

Empty DataFrame
Columns: [transaction_id, cardholder_id, amount]
Index: []

'Anomalous transactions for Cardholder ID:5 '

Empty DataFrame
Columns: [transaction_id, cardholder_id, amount]
Index: []

'Anomalous transactions for Cardholder ID:24 '

Empty DataFrame
Columns: [transaction_id, cardholder_id, amount]
Index: []

'Anomalous transactions for Cardholder ID:24 '

      transaction_id  cardholder_id  amount
3232             528             24   258.0
3245            2192             24   466.0
3251            1821             24  1011.0
3285            2461             24  1301.0
3300            1119             24  1035.0
3303            2241             24   525.0
3328            3064             24  1901.0
3366             682             24   291.0